#!/bin/bash
########################################################################################################################################################################
########################################################################################################################################################################
    GOOGLE_URL="https://docs.google.com/spreadsheets/d/15LnQY1SpHplWb-EyYFAOWNgtPOBZ8-CjARjQlt18qXI/edit?pli=1&gid=402919633#gid=402919633"
    SHEET_NAME="Testcase Register ✨"
########################################################################################################################################################################
########################################################################################################################################################################





























rm -f reports/${SHEET_NAME}.json

echo "✨ เริ่มรัน Testcase"
npx cypress run --reporter mochawesome --reporter-options "reportDir=reports,reportFilename=${SHEET_NAME},overwrite=true,html=false,json=true"

echo "✨ กำลังอัพเดทข้อมูล..."
node Upload/UploadSheet.js "$GOOGLE_URL" "$SHEET_NAME" "$SHEET_NAME"
